In [17]:
from sqlalchemy import create_engine
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

database_name = 'scooters'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

scooters = create_engine(connection_string)

In [22]:
#- Are there any null values in any columns in either table?
some_null = '''
SELECT *
FROM INFORMATION_SCHEMA.COLUMNS
WHERE TABLE_NAME = 'scooters'
ORDER BY ORDINAL_POSITION

'''
result = scooters.execute(some_null)

fucksake = pd.read_sql(some_null, con = scooters)
fucksake

,table_catalog,table_schema,table_name,column_name,ordinal_position,column_default,is_nullable,data_type,character_maximum_length,character_octet_length,...,is_identity,identity_generation,identity_start,identity_increment,identity_maximum,identity_minimum,identity_cycle,is_generated,generation_expression,is_updatable
0,scooters,public,scooters,pubdatetime,1,None,YES,timestamp without time zone,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
1,scooters,public,scooters,latitude,2,None,YES,numeric,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
2,scooters,public,scooters,longitude,3,None,YES,numeric,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
3,scooters,public,scooters,sumdid,4,None,YES,text,None,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES
4,scooters,public,scooters,sumdtype,5,None,YES,text,None,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES
5,scooters,public,scooters,chargelevel,6,None,YES,numeric,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
6,scooters,public,scooters,sumdgroup,7,None,YES,text,None,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES
7,scooters,public,scooters,costpermin,8,None,YES,numeric,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
8,scooters,public,scooters,companyname,9,None,YES,text,None,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES

In [23]:
some_null = '''
SELECT *
FROM INFORMATION_SCHEMA.COLUMNS
WHERE TABLE_NAME = 'trips'
ORDER BY ORDINAL_POSITION

'''
result = scooters.execute(some_null)

fucksake = pd.read_sql(some_null, con = scooters)
fucksake

,table_catalog,table_schema,table_name,column_name,ordinal_position,column_default,is_nullable,data_type,character_maximum_length,character_octet_length,...,is_identity,identity_generation,identity_start,identity_increment,identity_maximum,identity_minimum,identity_cycle,is_generated,generation_expression,is_updatable
0,scooters,public,trips,pubtimestamp,1,None,YES,timestamp without time zone,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
1,scooters,public,trips,companyname,2,None,YES,text,None,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES
2,scooters,public,trips,triprecordnum,3,None,YES,text,None,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES
3,scooters,public,trips,sumdid,4,None,YES,text,None,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES
4,scooters,public,trips,tripduration,5,None,YES,numeric,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
5,scooters,public,trips,tripdistance,6,None,YES,numeric,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
6,scooters,public,trips,startdate,7,None,YES,date,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
7,scooters,public,trips,starttime,8,None,YES,time without time zone,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
8,scooters,public,trips,enddate,9,None,YES,date,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
9,scooters,public,trips,endtime,10,None,YES,time without time zone,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
10,scooters,public,trips,startlatitude,11,None,YES,numeric,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
11,scooters,public,trips,startlongitude,12,None,YES,numeric,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
12,scooters,public,trips,endlatitude,13,None,YES,numeric,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
13,scooters,public,trips,endlongitude,14,None,YES,numeric,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
14,scooters,public,trips,triproute,15,None,YES,text,None,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES
15,scooters,public,trips,create_dt,16,None,YES,timestamp without time zone,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES

In [53]:
# In column 'chargelevel' there are 770 row with null values.
some_null = '''
SELECT *
FROM trips
WHERE create_dt IS NULL
'''
result = scooters.execute(some_null)

fucksake = pd.read_sql(some_null, con = scooters)
fucksake

Empty DataFrame
Columns: [pubtimestamp, companyname, triprecordnum, sumdid, tripduration, tripdistance, startdate, starttime, enddate, endtime, startlatitude, startlongitude, endlatitude, endlongitude, triproute, create_dt]
Index: []

What date range is represented in each of the date columns? Investigate any values that seem odd.

In [57]:
dateinvestigation = '''
SELECT min(startdate) AS first_start, max(startdate) as last_start, min(enddate) as first_end, max(enddate) as last_end
FROM trips
'''
result = scooters.execute(dateinvestigation)

this = pd.read_sql(dateinvestigation, con = scooters)
this

#odd last enddate, maybe customer used until after 12pm that night?

  first_start  last_start   first_end    last_end
0  2019-05-01  2019-07-31  2019-05-01  2019-08-01

Is time represented with am/pm or using 24 hour values in each of the columns that include time?

In [60]:
#24hr formatting but starttime and endtime are in different formats
time = '''
SELECT starttime, endtime
FROM trips
'''
result = scooters.execute(time)
answers = pd.read_sql(time, con = scooters)
answers

              starttime          endtime
0       00:00:20.460000  00:02:52.346666
1       00:01:50.090000  00:03:33.026666
2       00:03:47.363333  00:07:13.596666
3       00:04:21.386666  00:06:59.176666
4       00:04:27.796666  00:06:23.150000
...                 ...              ...
565517         23:47:43         00:05:13
565518         23:57:19         00:00:28
565519         23:41:52         00:00:18
565520         23:26:15         01:48:35
565521         22:19:08         01:48:33

[565522 rows x 2 columns]

What values are there in the sumdgroup column? Are there any that are not of interest for this project? - bicyle, scooter, Scooter

In [61]:
names = '''
SELECT DISTINCT(sumdgroup)
FROM scooters
'''
result = scooters.execute(names)
answers = pd.read_sql(names, con = scooters)
answers

#don't need the 'bicycle info'

  sumdgroup
0   bicycle
1   scooter
2   Scooter

What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?

In [66]:
lat_lon = '''
SELECT Min(latitude) as min_lat, MAX(latitude) as max_lat, MIN(longitude) as min_lon, MAX(longitude) as max_lon
FROM scooters
'''
result = scooters.execute(lat_lon)
answers = pd.read_sql(lat_lon, con = scooters)
answers

   min_lat       max_lat    min_lon  max_lon
0      0.0  3.609874e+06 -97.443879      0.0

-What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.

In [69]:
tripinfo = '''
SELECT Min(tripduration) as min_tdur, MAX(tripduration) as max_tdur, MIN(tripdistance) as min_tdis, MAX(tripdistance) as max_tdis
FROM trips
'''
result = scooters.execute(tripinfo)
answers = pd.read_sql(tripinfo, con = scooters)
answers

    min_tdur  max_tdur    min_tdis      max_tdis
0 -19.358267  512619.0 -20324803.8  3.188448e+07

Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

In [74]:
conames = '''
SELECT DISTINCT(s.companyname)
FROM scooters as s

'''
result = scooters.execute(conames)
answers = pd.read_sql(conames, con = scooters)
answers

  companyname
0        Bird
1        Bolt
2      Gotcha
3        Jump
4        Lime
5        Lyft
6        Spin

In [75]:
conames = '''
SELECT DISTINCT(companyname)
FROM trips

'''
result = scooters.execute(conames)
answers = pd.read_sql(conames, con = scooters)
answers

     companyname
0           Bird
1  Bolt Mobility
2         Gotcha
3           JUMP
4           Lime
5           Lyft
6           SPIN